In [32]:
import numpy as np
import pandas as pd
import matplotlib as plt

In [33]:
df = pd.DataFrame(
    {'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [34]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [35]:
df[['From', 'To']] = df.From_To.str.split("_", expand=True)
df_tmp1 = df
df_tmp1

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [36]:
df_tmp1.drop(['From_To'], axis = 1)
df_tmp1 = df_tmp1[['From', 'To', 'FlightNumber', 'RecentDelays', 'Airline']]

In [37]:
df_tmp1

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris       10045.0      [23, 47]               KLM(!)
1    MAdrid      miLAN           NaN            []    <Air France> (12)
2    londON  StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis           NaN          [13]       12. Air France
4  Brussels     londOn       10085.0      [67, 32]          "Swiss Air"

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [42]:
df_tmp1['From'] = df_tmp1['From'].str.capitalize()
df_tmp1['To'] = df_tmp1['To'].str.capitalize()
df_tmp1

<ipython-input-42-bfd5c7dabae9>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_tmp1['From'] = df_tmp1['From'].str.capitalize()
<ipython-input-42-bfd5c7dabae9>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_tmp1['To'] = df_tmp1['To'].str.capitalize()

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan           NaN            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris           NaN          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each  first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.


Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [45]:
df_tmp1[['delay_1', 'delay_2']] = df_tmp1.RecentDelays.tolist()
df_tmp1

/home/adminp/anaconda3/envs/neuron/lib/python3.8/site-packages/numpy/core/_asarray.py:83: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  return array(a, dtype, copy=False, order=order)

ValueError: Must have equal len keys and value when setting with an iterable

In [44]:
df_tmp1

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM(!)
1    Madrid      Milan           NaN            []    <Air France> (12)
2    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      Paris           NaN          [13]       12. Air France
4  Brussels     London       10085.0      [67, 32]          "Swiss Air"